Revit 2024 API
IFCExportOptions Constructor (IFCExportOptions)
 Creates a copy of an IFCExportOptions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public IFCExportOptions(
	IFCExportOptions from
)
Visual Basic
Public Sub New ( _
	from As IFCExportOptions _
)
Visual C++
public:
IFCExportOptions(
	IFCExportOptions^ from
)
Parameters
from
Type: Autodesk.Revit.DB.IFCExportOptions
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
IFCExportOptions Class
IFCExportOptions Overload
Autodesk.Revit.DB Namespace